[
  {
    "nombre": "Aimar Duarte",
    "email": "aimardfcole@gmail.com",
    "bloque": "Docker / Contenedores",
    "que_se": "La teoria basica que hemos dado en clase este curso",
    "que_necesito": "Todo lo que necesite saber para aprobar los cursos de este año",
    "fecha": "23/09/2025 11:43"
  },
  {
    "nombre": "Enrique Morales",
    "email": "emoralescebanc@gmail.com",
    "bloque": "ERP / Odoo",
    "que_se": "El año pasado vimos un poco de Odoo por lo que no es un sistema nuevo.",
    "que_necesito": "Aunque no sea la primera vez con Odoo, mi nivel no es muy alto por lo que tendré que aprender mas sobre Odoo.",
    "fecha": "23/09/2025 12:13"
  },
  {
    "nombre": "Enrique Morales",
    "email": "emoralescebanc@gmail.com",
    "bloque": "Docker / Contenedores",
    "que_se": "Conozco los comandos básicos utilizados para crear un contenedor, encenderlo, apagarlo y eliminarlo.",
    "que_necesito": "Necesitaré aprender todo lo necesario para realizar el reto.",
    "fecha": "23/09/2025 12:34"
  },
  {
    "nombre": "Enrique Morales",
    "email": "emoralescebanc@gmail.com",
    "bloque": "Base de Datos (Postgres)",
    "que_se": "Básico nivel en bases de datos como \"MySQL\".",
    "que_necesito": "El uso de la base de datos de Postgres ya que nunca he utilizado una.",
    "fecha": "23/09/2025 12:36"
  },
  {
    "nombre": "Enrique Morales",
    "email": "emoralescebanc@gmail.com",
    "bloque": "Integraciones (Java / otros)",
    "que_se": "Es el apartado que mas fuerte tengo. A mi parecer mi nivel es bueno como para hacer todo lo necesario.",
    "que_necesito": "Alguna cosa puntual que no haya visto antes. En principio tengo bastante nivel.",
    "fecha": "23/09/2025 12:43"
  },
  {
    "nombre": "Aimar Redondo",
    "email": "aredondocebanc@gmail.com",
    "bloque": "ERP / Odoo",
    "que_se": "Sé para que se utiliza un poco por encima gracias a un par de clases del año pasado.",
    "que_necesito": "No se manejarlo ni como utilizarlo en mis pryectos.",
    "fecha": "23/09/2025 12:51"
  },
  {
    "nombre": "Aimar Redondo",
    "email": "aredondocebanc@gmail.com",
    "bloque": "Docker / Contenedores",
    "que_se": "Conozco los comandos básicos y que sirve para crear contenedores y demás cosas.",
    "que_necesito": "Me falta mucho por aprender sobre máquinas virtuales y todo ese campo.",
    "fecha": "23/09/2025 12:52"
  },
  {
    "nombre": "Aimar Redondo",
    "email": "aredondocebanc@gmail.com",
    "bloque": "Integraciones (Java / otros)",
    "que_se": "Puedo crear programas básicos desde 0 y que funcionen bien.",
    "que_necesito": "Necesito conseguir mas soltura y fluidez, además de conocer más conceptos aparte de POO y los típicos.",
    "fecha": "23/09/2025 12:54"
  },
  {
    "nombre": "Aimar Redondo",
    "email": "aredondocebanc@gmail.com",
    "bloque": "Base de Datos (Postgres)",
    "que_se": "Que es un entorno donde puedo desarrollar y crear bases de datos.",
    "que_necesito": "No se utilizarlo ni manejarlo.",
    "fecha": "23/09/2025 12:55"
  },
  {
    "nombre": "Luka Isasa",
    "email": "isasanovic4@gmail.com",
    "bloque": "Gestión del Proyecto",
    "que_se": "Para la gestion de proyectos se usar github y tambien github desktop que nos permite decargar los cambios hechos por otra persona al instante.",
    "que_necesito": "Necesito aprender igual alguna funcion de github que algunas cosas no entiendo y por otra parte aprender a usar un control de versiones eficaz",
    "fecha": "23/09/2025 12:59"
  },
  {
    "nombre": "Luka Isasa",
    "email": "isasanovic4@gmail.com",
    "bloque": "Docker / Contenedores",
    "que_se": "De Docker me se los comandos basicos, run, exec, stop, tambien crear imagenes y contenedores y crear contenedores con imagenes. Se parar y ejecutar cuando quiera.",
    "que_necesito": "Necesito entenderlo mejor, y tambien aprender de seguridad. Utilizar con soltura y rapido sin tener que estar mirando los comandos de vez en cuando porque se me olvidan.",
    "fecha": "23/09/2025 13:00"
  },
  {
    "nombre": "Luka Isasa",
    "email": "isasanovic4@gmail.com",
    "bloque": "Comunicación escrita",
    "que_se": "Explicar las cosas de la mejor maner y escribir redacciones o emails sencillos.",
    "que_necesito": "Necesito tener mas en cuenta los fallos ortograficos, porque al escribir rapido cometo bastantes fallos.",
    "fecha": "23/09/2025 13:02"
  },
  {
    "nombre": "Luka Isasa",
    "email": "isasanovic4@gmail.com",
    "bloque": "Competencia personal",
    "que_se": "Soy responsable, y siempre me gusta terminar las cosas a tiempo y bien ejecutadas. Siempre intento ayudar al compañero en lo que no pueda.",
    "que_necesito": "Algunas veces al querer hacerlo todo bien tardo mucho tiempo en tareas que se necitarian usar menos tiempo, esto es, tengo que mejorar en la manera de controlar el tiempo.",
    "fecha": "23/09/2025 13:05"
  },
  {
    "nombre": "Luka Isasa",
    "email": "isasanovic4@gmail.com",
    "bloque": "Base de Datos (Postgres)",
    "que_se": "De lenguaje sql se lo basico, crear tablas, consultas, PK, FK....",
    "que_necesito": "Pero hablando de Postgres no se nada, porque el año pasado usamos MySql. Por eso deberia aprender casi todo de Postgres. Crear, almacenar, consultas, vistas...",
    "fecha": "23/09/2025 13:07"
  },
  {
    "nombre": "Oihan Cabada",
    "email": "oihan.cebanc1@gmail.com",
    "bloque": "ERP / Odoo",
    "que_se": "Aprendí ciertas cosas el año pasado, a como crear una página y como crear las ventas y una tienda virtual añadiendo cosas a la página.",
    "que_necesito": "La verdad que todo, me gustaría refrescar todo de nuevo, ya que tengo ciertas cosas en mente de las que me acuerdo, pero no son cien por cien fiables, ya que hace mucho que no trabajo con ello.",
    "fecha": "23/09/2025 13:11"
  },
  {
    "nombre": "Oihan Cabada",
    "email": "oihan.cebanc1@gmail.com",
    "bloque": "Integraciones (Java / otros)",
    "que_se": "Conozco ciertas cosas de programación, concretamente hasta la rama de POO.",
    "que_necesito": "Necesito aprender a ser más constante con el trabajo en java, ya que me ayudará para fortalecer los conocimientos.",
    "fecha": "23/09/2025 13:13"
  },
  {
    "nombre": "Oihan Cabada",
    "email": "oihan.cebanc1@gmail.com",
    "bloque": "Base de Datos (Postgres)",
    "que_se": "Crear una base de datos con sus tablas y sus respectivas variables.",
    "que_necesito": "Indagar más dentro de los postgres, ya que es una parte que no he tocado mucho y es más específica dentro de la base de datos.",
    "fecha": "23/09/2025 13:14"
  },
  {
    "nombre": "Oihan Cabada",
    "email": "oihan.cebanc1@gmail.com",
    "bloque": "Comunicación oral",
    "que_se": "Sé presentar y hablar en público sin ponerme nervioso en ningún momento, manteniendo la calma en todo momento e intentando explicar lo mejor posible todos los detalles a presentar.",
    "que_necesito": "Creo que a veces me excedo explicando y me precipito a la hora de hablar, lo que conlleva que hable demasiado rápido a veces y no se me entienda bien.",
    "fecha": "23/09/2025 13:20"
  }
]